In [15]:
import dask.dataframe as dd
from dask.distributed import Client

In [16]:
client = Client('localhost:8786')

In [3]:
path= '../data/*.parquet'
predicates=[('country','==', 'Malaysia'),]
columns = ['id', 'first_name', 'last_name', 'country',]

In [4]:
df = dd.read_parquet(path, engine="pyarrow-dataset", columns=columns, filters=predicates)

In [5]:
%%time
df.compute()

CPU times: user 7.79 ms, sys: 6.76 ms, total: 14.6 ms
Wall time: 41.3 ms

    id   first_name last_name   country
0  118        Randy    Kelley  Malaysia
1  140  Christopher    Turner  Malaysia
2  513        Wayne      Ward  Malaysia
3  769        Wayne    Bailey  Malaysia
4  778        Julia    Taylor  Malaysia
5  829       Samuel    Willis  Malaysia
6  860       Louise       Cox  Malaysia
7  898       Ronald   Mendoza  Malaysia
0   57     Virginia      Bell  Malaysia
1  298       Johnny     Kelly  Malaysia
2  344      Stephen    Powell  Malaysia
3  480      Charles     Mccoy  Malaysia
4  997        Helen    Fields  Malaysia
0  128        Wayne       Kim  Malaysia
1  275       Dennis    Hughes  Malaysia
2  478    Christina   Hawkins  Malaysia
3  705       Steven   Ramirez  Malaysia
4  787       Thomas    Chavez  Malaysia
5  918        Jimmy    Duncan  Malaysia
6  990      Rebecca      Diaz  Malaysia
7  993       Sharon      Ward  Malaysia
8  996      Deborah    Chavez  Malaysia
0  667         Lois   Freeman  Malaysia
0  104        Henry   Gardner  Malaysia
1  445       Louise    Torres  Malaysia
2  813       Walter      Sims  Malaysia
3  823                 Carter  Malaysia
4  928       Gloria    Nguyen  Malaysia

In [22]:
 path = "../data/*.parquet"

In [23]:
 df = dd.read_parquet(
            path,
            engine="pyarrow-dataset",
        )

In [24]:
grouped_df = df["country"].value_counts()

In [27]:
print(type(grouped_df))

<class 'dask.dataframe.core.Series'>